src/Documents/ММ_ПланированиеТехнологическихРабот/ММ_ПланированиеТехнологическихРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ММ_ПланированиеТехнологическихРабот</name>
  <attributes>
    <name>ДатаНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяРабота</name>
    <type>
      <types>EnumRef.ММ_ПланируемыеВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновляемаяБаза</name>
    <type>
      <types>CatalogRef.ММ_БазаДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьПользователей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматизацияОбновления</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонУведомления</name>
    <type>
      <types>CatalogRef.ММ_ШаблоныСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьБазу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокОбновляемыхРасширений</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.ММ_Расширения</types>
      </type>
    </attributes>
    <attributes>
      <name>Обновлять</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособОбновления</name>
      <type>
        <types>EnumRef.ММ_СпособыОбновления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/ММ_ВидыШаблоновОтправкиСообщений/ММ_ВидыШаблоновОтправкиСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ММ_ВидыШаблоновОтправкиСообщений</name>
  <enumValues>
    <name>ПроизвольныйТекст</name>
  </enumValues>
  <enumValues>
    <name>ОбновлениеБазы</name>
  </enumValues>
  <enumValues>
    <name>НедоступностьСервера</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ММ_ПланированиеТехнологическихРабот/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	МинутПростоя = Константы.ММ_КоличествоМинутСтандартногоТехнологическогоПростоя.Получить();
	ПланируемаяРаботаПриИзмененииНаСервере();

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.УведомитьПользователей = Истина;
		Объект.АвтоматизацияОбновления = Истина;
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ШаблонУведомления.Видимость = Объект.УведомитьПользователей;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УведомитьПользователейПриИзменении(Элемент)
	Элементы.ШаблонУведомления.Видимость = Объект.УведомитьПользователей;
КонецПроцедуры
&НаКлиенте
Процедура ПланируемаяРаботаПриИзменении(Элемент)
	ПланируемаяРаботаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновляемаяБазаПриИзменении(Элемент)
	ОбновляемаяБазаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаРаботПриИзменении(Элемент)
	КоличествоСекунд = 60;
	Объект.ДатаОкончанияРабот = Объект.ДатаНачалаРабот + МинутПростоя
		* КоличествоСекунд;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ПланируемаяРаботаПриИзмененииНаСервере()
	ЭтоОбновление = Объект.ВидШаблона = Перечисления.ММ_ВидыШаблоновОтправкиСообщений.ОбновлениеБазы;

	Элементы.ОбновляемаяБаза.Видимость = ЭтоОбновление;
	Элементы.СписокОбновляемыхРасширений.Видимость = ЭтоОбновление;
	Элементы.АвтоматизацияОбновления.Видимость = ЭтоОбновление;
	Элементы.База.Видимость = ЭтоОбновление;

КонецПроцедуры

&НаСервере
Процедура ОбновляемаяБазаПриИзмененииНаСервере()

	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	ММ_Расширения.Ссылка Как Расширение,
						  |	ММ_Расширения.СпособОбновления,
						  |	ИСТИНА КАК Обновлять
						  |ИЗ
						  |	Справочник.ММ_Расширения КАК ММ_Расширения
						  |ГДЕ
						  |	ММ_Расширения.Владелец = &Владелец
						  |	И НЕ ММ_Расширения.ПометкаУдаления");
	Запрос.УстановитьПараметр("Владелец", Объект.ОбновляемаяБаза);
	Объект.СписокОбновляемыхРасширений.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

#КонецОбласти
